Import libraries

In [36]:

import pandas as pd
import numpy as numpy
import matplotlib.pyplot as plt
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"
from colorama import Fore, Back, Style 
color = Fore.YELLOW

Import data

In [48]:
# get books dataframe
i_cols = ['isbn', 'book_title' ,'book_author','year_of_publication', 'publisher', 'img_s', 'img_m', 'img_l']
books = pd.read_csv('Data/Book reviews/BX_Books.csv', sep=';', names = i_cols , encoding='latin-1',low_memory=False)

# About data
print(f'{color}Head of books dataframe:')
books.head(5)
print(f'{color}\nBooks dataframe description: ')
books.describe()
print(f'\n{color}Data type of each colum: ')
books.dtypes

Head of books dataframe:

,isbn,book_title,book_author,year_of_publication,publisher,img_s,img_m,img_l
0,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
1,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
2,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
3,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
4,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...

Books dataframe description:

,isbn,book_title,book_author,year_of_publication,publisher,img_s,img_m,img_l
count,271380,271380,271379,271380,271378,271380,271380,271380
unique,271380,242155,102029,117,16806,271064,271064,271064
top,ISBN,Selected Poems,Agatha Christie,2002,Harlequin,http://images.amazon.com/images/P/074343045X.0...,http://images.amazon.com/images/P/074343045X.0...,http://images.amazon.com/images/P/074343045X.0...
freq,1,27,632,17628,7536,2,2,2

Data type of each colum:

isbn                   object
book_title             object
book_author            object
year_of_publication    object
publisher              object
img_s                  object
img_m                  object
img_l                  object
dtype: object

In [47]:
# get users dataframe
u_cols = ['user_id', 'location', 'age']
users = pd.read_csv('Data/Book reviews/BX-Users.csv', sep=';',names = u_cols,encoding='latin-1',low_memory=False)

# About data
print(f'{color}Head of users dataframe:')
users.head(5)
print(f'{color}\nUsers dataframe description: ')
users.describe()
print(f'\n{color}Data type of each colum: ')
users.dtypes

Head of users dataframe:

   user_id                         location  age
0  User-ID                         Location  Age
1        1               nyc, new york, usa  NaN
2        2        stockton, california, usa   18
3        3  moscow, yukon territory, russia  NaN
4        4        porto, v.n.gaia, portugal   17

Users dataframe description:

        user_id                         location     age
count    278859                           278859  168097
unique   278859                            57340     166
top     User-ID  london, england, united kingdom      24
freq          1                             2506    5687

Data type of each colum:

user_id     object
location    object
age         object
dtype: object

In [46]:
r_cols = ['user_id', 'isbn', 'rating']
ratings = pd.read_csv('Data/Book reviews/BX-Book-Ratings.csv', sep=';', names=r_cols, encoding='latin-1',low_memory=False)

# About dataframe
print(f'{color}Head of ratings dataframe:')
ratings.head(5)
print(f'{color}\nRatings dataframe description: ')
ratings.describe()
print(f'\n{color}Data type of each colum: ')
ratings.dtypes

Head of ratings dataframe:

   user_id        isbn       rating
0  User-ID        ISBN  Book-Rating
1   276725  034545104X            0
2   276726  0155061224            5
3   276727  0446520802            0
4   276729  052165615X            3

Ratings dataframe description:

        user_id        isbn   rating
count   1149781     1149781  1149781
unique   105284      340557       12
top       11676  0971880107        0
freq      13602        2502   716109

Data type of each colum:

user_id    object
isbn       object
rating     object
dtype: object

Data Proccessing